"Aw crap" = "aw อึ";
"Back" = "กลับ";
"Half full" = "ครึ่งหนึ่ง";
"How ya feeling today?" = "วิธีการบันทึกความรู้สึกในวันนี้?";
"Live half full." = "อาศัยอยู่ครึ่งหนึ่ง";
"Loading..." = "กำลังโหลด ...";
"Next" = "ต่อไป";
"No internet connection" = "ไม่มีการเชื่อมต่ออินเทอร์เน็ต";
"OK" = "ตกลง";
"Patience is a virtue." = "ความอดทนเป็นคุณธรรม";
"Share to Facebook" = "แบ่งปันไปที่ Facebook";
"Share to Twitter" = "แบ่งปันไปที่ Twitter";
"Sorry, this quote is too long to post to Twitter." = "ขออภัยพูดนี้เป็นเวลานานเกินไปที่จะโพสต์ทวิตเตอร์";
"The app that turns your frown upside down with a dose of inspiration to kick any bad mood in the butt!" = "app ที่เปลี่ยนหน้านิ่วคิ้วของคุณคว่ำที่มีขนาดของแรงบันดาลใจที่จะเตะใด ๆ อารมณ์ไม่ดีในก้น!";
"The glass is always" = "แก้วอยู่เสมอ";
"The quote hasn't loaded yet." = "อ้างได้ยังไม่ได้โหลด";
"Try Again" = "ลองใหม่อีกครั้ง";
"Whoops" = "ขออภัย";
"don't be angry." = "โกรธ";
"don't be impatient." = "ใจร้อน";
"don't be tired." = "เหนื่อย";
"don't be lonely." = "โดดเดี่ยว";
"don't be depressed." = "ตกต่ำ";
"don't be guilty." = "รู้สึกผิด";
"don't be sad." = "เสียใจ";
"don't be nostalgic." = "เกี่ยวกับความคิดถึง";
"don't be jealous." = "อิจฉา";
"don't be dull." = "น่าเบื่อ";
"don't be scared." = "ตกใจ";
"don't be anxious." = "กระวนกระวาย";
"angry" = "โกรธ";
"impatient" = "ใจร้อน";
"tired" = "เหนื่อย";
"lonely" = "โดดเดี่ยว";
"depressed" = "ตกต่ำ";
"guilty" = "รู้สึกผิด";
"sad" = "เสียใจ";
"nostalgic" = "เกี่ยวกับความคิดถึง";
"jealous" = "อิจฉา";
"dull" = "น่าเบื่อ";
"scared" = "ตกใจ";
"anxious" = "กระวนกระวาย";
